#### ViewNode Members

---

|  |
| --- |
| ViewNode Class   Methods   Properties   See Also |

The  ViewNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCameraInfo | Information about the observation point (the camera) of the view. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | LevelOfDetail | The level of detail the view is going to be rendered at. |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |
| Public property | ViewId | The Id of the view element. |

# See Also

ViewNode Class

Autodesk.Revit.DB Namespace